// かなだけMAP 2025-11
const spots = [
  { id: 1,  date: "2025-11-01", tag: "11/01", name: "都立亀戸中央公園", address: "東京都江東区亀戸9-37-28", lat: 35.7007507, lng: 139.8361199, time: "", url: "", img: "" },
  { id: 2,  date: "2025-11-03", tag: "11/03", name: "ドラムの里 感謝祭（栄町総合交流拠点 ドラムの里）", address: "千葉県印旛郡栄町龍角寺1039-1", lat: 35.823447,  lng: 140.273911,  time: "10:00-15:00", url: "", img: "" },
  { id: 3,  date: "2025-11-04", tag: "11/04", name: "タムスさくら病院 川口", address: "埼玉県川口市神戸258-1", lat: 35.852054, lng: 139.724731, time: "11:00-14:00", url: "", img: "" },
  { id: 4,  date: "2025-11-05", tag: "11/05", name: "獨協大学 草加キャンパス", address: "埼玉県草加市学園町1-1", lat: 35.839875, lng: 139.794229, time: "", url: "", img: "" },
  { id: 5,  date: "2025-11-06", tag: "11/06", name: "さいたま市役所 浦和本庁舎", address: "埼玉県さいたま市浦和区常盤6-4-4", lat: 35.861515, lng: 139.645502, time: "", url: "", img: "" },
　{ id: 6, date: "2025-11-08", tag: "11/08", name: "久喜総合文化会館", address: "埼玉県久喜市下早見140", lat: 36.060894, lng: 139.667556, time: "", url: "", img: "" },
  { id: 7,  date: "2025-11-09", tag: "11/09", name: "en market vol.5（守谷住宅公園・美容室porch）", address: "茨城県守谷市本町241-1", lat: 35.945108, lng: 139.993872, time: "10:00-16:00", url: "", img: "" },
  { id: 8,  date: "2025-11-11", tag: "11/11", name: "ダイナム戸ヶ崎店", address: "埼玉県三郷市戸ヶ崎3丁目585", lat: 35.79895,  lng: 139.867623, time: "", url: "", img: "" },
  { id: 9,  date: "2025-11-12", tag: "11/12", name: "獨協大学 草加キャンパス", address: "埼玉県草加市学園町1-1", lat: 35.839875, lng: 139.794229, time: "", url: "", img: "" },
  { id: 10, date: "2025-11-13", tag: "11/13", name: "蕨市役所", address: "埼玉県蕨市中央5-14-15", lat: 35.825613, lng: 139.679575, time: "", url: "", img: "" },
  { id: 11, date: "2025-11-15", tag: "11/15", name: "葛西臨海公園", address: "東京都江戸川区臨海町6丁目", lat: 35.643051, lng: 139.860395, time: "", url: "", img: "" },
  { id: 12, date: "2025-11-18", tag: "11/18", name: "タムスさくら病院 川口", address: "埼玉県川口市神戸258-1", lat: 35.852054, lng: 139.724731, time: "11:00-14:00", url: "", img: "" },
  { id: 13, date: "2025-11-19", tag: "11/19", name: "獨協大学 草加キャンパス", address: "埼玉県草加市学園町1-1", lat: 35.839875, lng: 139.794229, time: "", url: "", img: "" },
  { id: 14, date: "2025-11-20", tag: "11/20", name: "聖路加国際大学", address: "東京都中央区明石町10-1", lat: 35.667876, lng: 139.775819, time: "", url: "", img: "" },
  { id: 15, date: "2025-11-22", tag: "11/22", name: "いちかわごちそうマルシェ（市川地方卸売市場）", address: "千葉県市川市鬼高4-5-1", lat: 35.71056,  lng: 139.92861,  time: "", url: "", img: "" },
  { id: 16, date: "2025-11-23", tag: "11/23", name: "公園フェスタ 光が丘公園", address: "東京都練馬区光が丘（公園内）", lat: 35.766411, lng: 139.62946,  time: "", url: "", img: "" },
  { id: 17, date: "2025-11-25", tag: "11/25", name: "ダイナム戸ヶ崎店", address: "埼玉県三郷市戸ヶ崎3丁目585", lat: 35.79895,  lng: 139.867623, time: "", url: "", img: "" },
  { id: 18, date: "2025-11-26", tag: "11/26", name: "埼玉東萌短期大学", address: "埼玉県越谷市新越谷2-21-1", lat: 35.8698806, lng: 139.7802389, time: "", url: "", img: "" },
  { id: 19, date: "2025-11-27", tag: "11/27", name: "さいたま市役所 浦和本庁舎", address: "埼玉県さいたま市浦和区常盤6-4-4", lat: 35.861515, lng: 139.645502, time: "", url: "", img: "" },
  { id: 20, date: "2025-11-29", tag: "11/29", name: "水元公園", address: "東京都葛飾区水元公園3-2（管理事務所付近）", lat: 35.786408, lng: 139.869253, time: "", url: "", img: "" },
  { id: 21, date: "2025-11-30", tag: "11/30", name: "クリスマスマーケット（下北線路街 空き地）", address: "東京都世田谷区北沢2-33-12 付近", lat: 35.661273, lng: 139.669574, time: "", url: "", img: "" }
];

if (typeof window !== "undefined") window.spots = spots;
